import re
import os
import json


import numpy as np
import pandas as pd


from df_preprocessing import extract_articles

def load_config(file_name: str) -> dict:
    """
    Загружает конфигурационный JSON из папки configs.
    """
    config_path = os.path.join('configs', file_name)
    if os.path.exists(config_path):
        with open(config_path, 'r', encoding='utf-8') as f:
            return json.load(f)
    return {}


matches = load_config('matches.json')


def load_dataset(file_excel: str, skiprows: int = 8) -> pd.DataFrame | None:
    """
    Загружает данные о ремонтах из Excel-файла.
    """
    try:
        data = pd.read_excel(file_excel, skiprows=range(skiprows), dtype=str)
        print(f"Файл успешно загружен из Excel: {file_excel}")
        return data
    except FileNotFoundError:
        print("Файлы не найдены. Проверьте путь к CSV и Excel.")
        return None
    

def extract_model_case_insensitive(machine: str, brand: str) -> str:
    """
    Извлекает модель из строки названия машины, отсекая название бренда.
    """
    if pd.isna(machine) or pd.isna(brand):
        return None

    machine_lower = machine.lower()
    brand_lower = brand.lower()
    idx = machine_lower.find(brand_lower)
    if idx == -1:
        return None

    return machine[idx + len(brand):].strip()


def preprocess_repair_parts(file_path: str, skiprows: int = 8) -> pd.DataFrame:
    """
    Полный цикл предобработки отчета 'Запчасти списанные в ремонт': 
    загружает файл и сразу прогоняет через предобработку.
    """
    data = load_dataset(file_path, skiprows)
    df = data.copy()
    df.columns = df.columns.str.strip()

    df = df[~(df['Номенклатура.Оригинальный номер'].isna() & df['Номенклатура.Артикул'].isna())]
    df = df[df['Машина'].str.contains('подъемник', case=False, na=False)].copy()

    df['Номенклатура'] = df['Номенклатура'].str.strip()

    type_conditions = [
        df['Машина'].str.contains('ножничный', case=False, na=False),
        df['Машина'].str.contains('коленчатый', case=False, na=False),
        df['Машина'].str.contains('телескопический', case=False, na=False),
        df['Машина'].str.contains('мачтовый', case=False, na=False)
    ]

    lift_type_labels = ['ножничный', 'коленчатый', 'телескопический', 'мачтовый']

    df['Тип подъемника'] = np.select(type_conditions, lift_type_labels, default='другое')

    engine_conditions = [
        df['Машина'].str.contains('электрический', case=False, na=False),
        df['Машина'].str.contains('дизельный', case=False, na=False),
    ]

    engine_labels = ['Электрический', 'Дизельный']

    df['Тип двигателя'] = np.select(engine_conditions, engine_labels, default='Дизельный')

    df = df.drop(columns=[col for col in df.columns if 'Unnamed' in col])

    df['Дата'] = pd.to_datetime(df['Дата'], format='%d.%m.%Y %H:%M:%S')
    df['Год'] = df['Дата'].dt.year
    df['Квартал'] = df['Дата'].dt.quarter

    df['Лот.CRM год выпуска'] = df['Лот.CRM год выпуска'].apply(lambda x: int(x.replace(',', '')) if isinstance(x, str) else x)
    df['Средняя наработка (лет)'] = df['Год'] - df['Лот.CRM год выпуска']
    df['Номера машин'] = df.apply(lambda row: extract_model_case_insensitive(row['Машина'], row['Машина.Бренд']), axis=1)

    return df


def del_wrong_numbers_df1(df):

    df.loc[df['Номенклатура.Оригинальный номер расширенный'] == 'JCPT1412HA','Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура.Оригинальный номер расширенный'] == 'AMWP11.5-8100','Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура.Оригинальный номер расширенный'] == 'ZS1212','Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура.Артикул'] == 'DIFA438201', 'Номенклатура.Оригинальный номер расширенный'] = '4382-01'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный 32925682', 'Номенклатура.Оригинальный номер расширенный'] = '32/925682 AF26656'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный 32925682', 'Номенклатура.Оригинальный номер'] = '32/925682'
    df.loc[df['Номенклатура'] == 'НПУ 00007940', 'Номенклатура.Артикул'] = '85000159'
    df.loc[df['Номенклатура'] == 'НПУ 00007940', 'Номенклатура.Оригинальный номер'] = '85000159'
    df.loc[df['Номенклатура'] == 'НПУ 00007940', 'Номенклатура.Оригинальный номер расширенный'] = '85000159'
    df.loc[df['Номенклатура'] == 'Цилиндр поворота платформы 1010201914', 'Номенклатура.Оригинальный номер'] = '1010201914'
    df.loc[df['Номенклатура'] == 'Трос аварийного опускания Haulotte Compact', 'Номенклатура.Оригинальный номер'] = '2420314420'
    df.loc[df['Номенклатура'] == 'Трос аварийного опускания Haulotte Compact', 'Номенклатура.Оригинальный номер расширенный'] = '2326009100'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный 90031461A', 'Номенклатура.Оригинальный номер расширенный'] = '43121'
    df.loc[df['Номенклатура'] == 'Фильтр масляный C-7926', 'Номенклатура.Оригинальный номер расширенный'] = '1009900560 1009901968 15056-32432 15521-32439 16098-31291 1C01032432 1C020-32430 1C020-32432 1C020-32433 1C020-32434 1C020-32434-P 1C02032434 279809 4042216 582018366 807180 HH1C0-32430 HH1C032430 HLX-6995 LF3376 P550318'
    df.loc[df['Номенклатура'] == 'Датчик 203150000055', 'Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура'] == 'Фильтр топливный Yanmar DF-5543', 'Номенклатура.Оригинальный номер расширенный'] = '201990003015 60356164 7029012 A977950 MIU802421 SF-52010 SF52010 SK48584 SN25127 XJAU01355 XJAU01515 YM129A0055730'
    df.loc[df['Номенклатура'] == 'Клапан балансировочный поворотного редуктора корзины 1019901661', 'Номенклатура.Оригинальный номер расширенный'] = '1010201471 ls2-009-180qmajc'
    df.loc[df['Номенклатура'] == 'Фильтр гидравлический в сборе 00001871', 'Номенклатура.Оригинальный номер расширенный'] = '00004696 0160D010BN3HC SH75028'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный A8506S', 'Номенклатура.Оригинальный номер расширенный'] = '1000100310 P827653 RF3091AB ST40706'
    df.loc[df['Номенклатура'] == 'Фильтр топливный SFC7945002', 'Номенклатура.Оригинальный номер расширенный'] = '1010601542 SFC-79450-02 SFC7945002 SK3170 ST20094'
    df.loc[df['Номенклатура'] == 'Фильтр гидравлический CS05030P10A', 'Номенклатура.Оригинальный номер расширенный'] = '202080000036 SH56560 SP-06X10G3 SPF-53 SPF-538-100 stx202027'
    df.loc[df['Номенклатура'] == 'Элемент фильтра гидравлического 00004416', 'Номенклатура.Оригинальный номер расширенный'] = '00003113 00004416'
    df.loc[df['Номенклатура'] == 'Стартер Kubota 2403 TT15790', 'Номенклатура.Оригинальный номер расширенный'] = '17123-6301-6 17123-63017 1712363016 1712363017 CPK00215'
    df.loc[df['Номенклатура'] == 'Фильтр топливный FS36209', 'Номенклатура.Оригинальный номер расширенный'] = '1000000876 201990000029'
    df.loc[df['Номенклатура'] == 'Фильтр топливный ГО BA16-22CRT 10003966A (Kubota)', 'Номенклатура.Оригинальный номер расширенный'] = '1g311-43380 1g31143380 8972133810 FF5468 PF9873 SK3686 SN21586'
    df.loc[df['Номенклатура'] == 'Фильтр топливный GB6245', 'Номенклатура.Оригинальный номер расширенный'] = '1000700908 PL420 ST21350'
    df.loc[df['Номенклатура'] == 'Фильтр масляный MANN-W 814/80', 'Номенклатура.Оригинальный номер расширенный'] = '11923630 199100323 2151740 2151740 749613 HH164-32430'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный DIFA 43121', 'Номенклатура.Оригинальный номер расширенный'] = '90029290 90031461A AF26656 P608533 P609490 ST40110 Z32540'
    df.loc[df['Номенклатура'] == 'Фильтр гидравлический R0110A10NHA', 'Номенклатура.Оригинальный номер расширенный'] = 'LH0110R010BN/HC DH3723 RHR110G10B3/AB1 P170604'
    df.loc[df['Номенклатура'] == 'ЭБУ 203020000001', 'Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура'] == 'Зарядное устройство 2029900000311', 'Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура'] == 'Насос гидравлический 81013GT', 'Номенклатура.Оригинальный номер расширенный'] = np.nan
    df.loc[df['Номенклатура'] == 'Фильтрующий элемент очистки воздуха (внутренний) 4382-01', 'Номенклатура.Оригинальный номер расширенный'] = 'DIFA 4382-01'
    df.loc[df['Номенклатура'] == 'Фильтрующий элемент очистки воздуха (внутренний) 4382-01', 'Номенклатура.Артикул'] = 'DIFA 4382-01'
    df.loc[df['Номенклатура'] == 'Замок зажигания 90173', 'Номенклатура.Оригинальный номер расширенный'] = '84830'
    df.loc[df['Номенклатура'] == 'Стартер 1002415445С', 'Номенклатура.Оригинальный номер расширенный'] = '1003692596B 1009806744'
    df.loc[df['Номенклатура'] == 'Фильтр масляный ST14115', 'Номенклатура.Оригинальный номер расширенный'] = '01174416 32665 90024289 90024289A'

    df.loc[df['Номенклатура'] == 'Крышка гидравлического бака (ВА 16-22)', 'Номенклатура.Оригинальный номер расширенный'] = '90003907 90003907A'
    df.loc[df['Номенклатура'] == 'Двигатель вращения 00004901', 'Номенклатура.Оригинальный номер расширенный'] = '0000490'
    df.loc[df['Номенклатура'] == 'Цилиндр выравнивания платформы 77370030100000', 'Номенклатура.Оригинальный номер расширенный'] = '773700301000001'
    df.loc[df['Номенклатура'] == 'Кронштейн крепления гидравлического фильтра 104024023003B', 'Номенклатура.Оригинальный номер расширенный'] = '104024023003B02'
    df.loc[df['Номенклатура'] == 'Замок зажигания 4130000723', 'Номенклатура.Оригинальный номер расширенный'] = '4130000723001'
    df.loc[df['Номенклатура'] == 'фильтр воздушный! D105.6 d60 H274 \ Caterpillar, Bobcat, Komatsu, Kubota', 'Номенклатура.Оригинальный номер расширенный'] = '91745'
    df.loc[df['Номенклатура'] == 'Контактор 24V 200A  28.01.000285', 'Номенклатура.Оригинальный номер расширенный'] = '2801000285'

    df.loc[df['Номенклатура'] == 'Фильтр гидравлический RHR110G10B3/AB1', 'Номенклатура.Оригинальный номер расширенный'] = '(LH)0110A10BN/HA(HC) 0110R010BN3HC KFSF-0110-R-010-N R0110 R0110A010NHA R0110A10NHA'

    df.loc[df['Номенклатура'] == 'Фильтр воздушный Z32540', 'Номенклатура.Оригинальный номер'] = '90029290'

    df.loc[df['Номенклатура'] == 'Фильтрующий элемент очистки воздуха (внешний) 4382', 'Номенклатура.Оригинальный номер расширенный'] = np.nan

    df.loc[df['Номенклатура'] == 'Фильтр воздушный внутренний P829333', 'Номенклатура.Оригинальный номер расширенный'] = '216070000008 4383-01'

    df.loc[df['Номенклатура'] == 'Фильтр воздушный внешний P828889', 'Номенклатура.Оригинальный номер расширенный'] = '216070000004 4383'

    df.loc[df['Номенклатура'] == 'Фильтр масляный C1110', 'Номенклатура.Оригинальный номер расширенный'] = '90024289 SO228 C-1405 LS32665 01174416'

    df.loc[df['Номенклатура'] == 'Фильтр воздушный комплект p828889', 'Номенклатура.Оригинальный номер расширенный'] = '216070000004 4383'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный комплект p828889', 'Номенклатура.Оригинальный номер'] = '00006753'

    df.loc[df['Номенклатура'] == 'Фильтр гидравлический D0110A10NHA', 'Номенклатура.Оригинальный номер расширенный'] = '00004697 D0110A10NHA LH0110D010BN3HC'

    df.loc[df['Номенклатура'] == 'Фильтр воздушный DIFA 43121-01', 'Номенклатура.Артикул'] = 'DIFA 43121-01'

    df.loc[df['Номенклатура'] == 'Фара 00006753A/00005190A', 'Номенклатура.Артикул'] = '00006753'
    df.loc[df['Номенклатура'] == 'Фара 00006753A/00005190A', 'Номенклатура'] = 'Фара головного света 00006753'
    df.loc[df['Номенклатура'] == 'Фильтр масляный C-1049', 'Номенклатура.Артикул'] = 'C1049'
    df.loc[df['Номенклатура'] == 'Фильтр воздушный  DIFA4382 (внешний)','Номенклатура.Оригинальный номер расширенный'] = np.nan

    cols = [
        'Номенклатура.Артикул',
        'Номенклатура.Оригинальный номер',
        'Номенклатура.Оригинальный номер расширенный'
    ]

    df[cols] = df[cols].replace(r'DIFA\s*', '', regex=True)

    df[cols] = df[cols].replace(r'\s+', ' ', regex=True).apply(lambda x: x.str.strip())

    df.loc[df['Номенклатура.Артикул'] == '438201', 'Номенклатура.Артикул'] = '4382-01'

    mask_plus = (
        df['Номенклатура'].str.contains(r'\+', na=False) &
        ~df['Номенклатура'].str.contains(r'^(?:Колесо|РВД|[Оо]богреватель|Контроллер|Deutz|Выключатель|Батарея|Рукав|Фильтр воздушный к-кт \(внутр\.\+внешн\.\) 1351230502)', na=False) # Учесть фильтр последний (т.е найти его аналоги)
    )

    mask_st_units = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40111/40110',
        case=False,
        na=False
    )

    mask_brackets = df['Номенклатура'].str.contains(
        r'(95*165*340/70*90*335,',
        case=False,
        na=False,
        regex=False
    )

    mask_kt = df['Номенклатура'].str.contains(
        r'Фильтр воздушный AF26656 к-т',
        case=False,
        na=False,
    )

    mask_AB = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40131AB',
        case=False,
        na=False,
    )

    mask_hid = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40111ST40110',
        case=False,
        na=False,
    )

    complects = df[mask_plus | mask_st_units | mask_brackets | mask_kt | mask_AB | mask_hid]
    complects.loc[complects['Номенклатура'] == 'Фильтр воздушный AF26656 к-т', 'Номенклатура'] = 'Фильтр воздушный к-т AF26656+AF26655'
    complects.loc[complects['Номенклатура'] == 'Фильтр воздушный ST40131AB', 'Номенклатура'] = 'Фильтр воздушный (95*165*340/70*90*335, сдвоенный) kw1634'

    df = df[~df.index.isin(complects.index)]
        
    complects['Номенклатура.Артикул'] = complects['Номенклатура'].apply(lambda x: extract_articles(x, matches.keys()))

    df_exploded = complects.explode('Номенклатура.Артикул').reset_index(drop=True)

    df_exploded['Номенклатура.Оригинальный номер'] = df_exploded['Номенклатура.Артикул'].map(lambda x: matches[x].split()[0] if x in matches else None)
    df_exploded['Номенклатура.Оригинальный номер расширенный'] = df_exploded['Номенклатура.Артикул'].map(matches)

    assert (df_exploded.shape[0] == complects.shape[0] * 2)

    df = pd.concat([df, df_exploded], ignore_index=True)

    df = df.sort_values(by='Дата', ignore_index=True)

    return df


def preprocess_stock_report(file_path: str, skiprows: int = 8) -> pd.DataFrame:
    """
    Полный цикл предобработки отчета 'Остатки и обороты': 
    загружает файл и сразу прогоняет через предобработку.
    """
    data = load_dataset(file_path, skiprows)
    df = data.copy()
    df.columns = df.columns.str.strip()

    df['Склады_продажа'] = df['Склад']
    df['Номенклатура'] = df['Номенклатура'].str.strip()

    period_mask = df['Номенклатура'].str.contains(
        r'\d{4} г\.|\d квартал \d{4} г\.|Январь|Февраль|Март|Апрель|Май|Июнь|Июль|Август|Сентябрь|Октябрь|Ноябрь|Декабрь',
        na=False
    )

    df['year'] = df['Номенклатура'].str.extract(r'\b(20[2-9]\d)\b')
    df['quarter'] = df['Номенклатура'].str.extract(r'(\d квартал)')
    df['month'] = df['Номенклатура'].str.extract(
        r'(Январь|Февраль|Март|Апрель|Май|Июнь|Июль|Август|Сентябрь|Октябрь|Ноябрь|Декабрь)'
    )
    df[['year','quarter','month']] = df[['year','quarter','month']].ffill()
    df = df[~period_mask]

    df['Квартал'] = df['quarter'].str.extract(r'(\d)').astype(int)

    month_map = {
        'Январь': 1, 'Февраль': 2, 'Март': 3, 'Апрель': 4, 'Май': 5, 'Июнь': 6,
        'Июль': 7, 'Август': 8, 'Сентябрь': 9, 'Октябрь': 10, 'Ноябрь': 11, 'Декабрь': 12
    }

    df['Месяц'] = df['month'].map(month_map).astype(int)
    df['Год'] = df['year']
    df.drop(columns=['Unnamed: 0', 'month', 'quarter', 'year', 'Склад'], inplace=True, errors='ignore')
    df = df.loc[(df['Артикул'].notna()) | (df['Оригинальный номер'].notna())]

    for col in ["Расход", "Приход", "Конечный остаток"]:
        df[col] = (
            df[col]
            .str.replace(',', '', regex=False)
            .astype(float)
        )
    
    return df


def del_wrong_numbers_df2(df):
        
    cols = [
        'Артикул',
        'Оригинальный номер',
    ]

    df[cols] = df[cols].replace(r'DIFA\s*', '', regex=True)

    df[cols] = df[cols].replace(r'\s+', ' ', regex=True).apply(lambda x: x.str.strip())

    df.loc[df['Артикул'] == '32925682', 'Оригинальный номер'] = '32925682'
    df.loc[df['Артикул'] == '4312101', 'Артикул'] = '43121-01'
    df.loc[df['Артикул'] == '438201', 'Артикул'] = '4382-01'
    df.loc[df['Артикул'] == '438301', 'Артикул'] = '4383-01'
    df.loc[df['Номенклатура'] == 'НПУ 00007940', 'Артикул'] = '85000159'
    df.loc[df['Номенклатура'] == 'Насос подкачки 4128101', 'Артикул'] = '04128101'
    df.loc[df['Номенклатура'] == 'Фильтр масляный C-1049', 'Артикул'] = 'C1049'
    df.loc[df['Номенклатура'] == 'Насос подкачки 4128101', 'Оригинальный номер'] = '04128101'
    df.loc[df['Номенклатура'] == 'Цепь ГРМ Cummins ISF2.8', 'Оригинальный номер'] = '4982040f'
    df.loc[df['Номенклатура'] == 'Насос 00003102A', 'Оригинальный номер'] = '00003102'
    df.loc[df['Номенклатура'] == 'Колесо в сборе 105051034051A', 'Артикул'] = '105051034051A'
    df.loc[df['Номенклатура'] == 'Предохранитель автоматический 30А  291.3722,', 'Артикул'] = '291.3722'
    df.loc[df['Номенклатура'] == 'Предохранитель автоматический 30А  291.3722,', 'Оригинальный номер'] = '291.3722'

    mask_plus = (
        df['Номенклатура'].str.contains(r'\+', na=False) &
        ~df['Номенклатура'].str.contains(
            r'^(Колесо|РВД|[Оо]богреватель|Распределитель|Насос|Комплект|Кабель|Гидроцилиндр|Датчик|Коллектор|Фильтр топливный PERKINS|Фильтр воздушный \(внешний\+внутренний\) A5541S)',
            na=False
        )
    )

    mask_st_units = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40111/40110',
        case=False,
        na=False
    )
    mask_brackets = df['Номенклатура'].str.contains(
        r'(95*165*340/70*90*335,',
        case=False,
        na=False,
        regex=False
    )

    mask_kt = df['Номенклатура'].str.contains(
        r'Фильтр воздушный AF26656 к-т',
        case=False,
        na=False,
    )

    mask_AB = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40131AB',
        case=False,
        na=False,
    )

    mask_hid = df['Номенклатура'].str.contains(
        r'Фильтр воздушный ST40111ST40110',
        case=False,
        na=False,
    )

    mask_filter = df['Номенклатура'].str.contains(
        r'Фильтр воздушный 6666375/6666376',
        case=False,
        na=False,
    )

    complects2 = df[mask_plus | mask_st_units | mask_brackets | mask_kt | mask_AB | mask_hid | mask_filter]
    complects2.loc[complects2['Номенклатура'] == 'Фильтр воздушный AF26656 к-т', 'Номенклатура'] = 'Фильтр воздушный к-т AF26656+AF26655'
    complects2.loc[complects2['Номенклатура'] == 'Фильтр воздушный ST40131AB', 'Номенклатура'] = 'Фильтр воздушный (95*165*340/70*90*335, сдвоенный) kw1634'

    df = df[~df.index.isin(complects2.index)]

    complects2['Артикул'] = complects2['Номенклатура'].apply(lambda x: extract_articles(x, matches.keys()))

    df_exploded = complects2.explode('Артикул').reset_index(drop=True)

    df_exploded['Оригинальный номер'] = df_exploded['Артикул'].map(lambda x: matches[x].split()[0] if x in matches else None)

    assert (df_exploded.shape[0] == complects2.shape[0] * 2)

    df = pd.concat([df, df_exploded], ignore_index=True)

    return df